Станьте IT HERO!

Предлагаем вам закрепить знания по программированию в новом увлекательном 
формате — вас ждёт настоящее кодинг-соревнование на площадке IT HERO!

IT HERO — это онлайн-сервис с задачами по программированию, своеобразный 
тренажёр для подготовки к техническим собеседованиям. Сейчас в сервисе есть 
задачи по Python и SQL.

Почему полезно писать код в режиме соревнования?
Решение множества задач расширит ваш кругозор и прочно свяжет теорию с 
практикой. Вы научитесь быстро вникать в условия, находить оптимальные 
инструменты для решения и писать грамотный код. Эти навыки очень пригодятся 
вам на технических собеседованиях, где решающую роль играют качество 
и скорость выполнения задания.

Как устроен сервис IT HERO?
Первым делом посмотрите видеоинструкцию — в ней вы найдёте подробные 
объяснения, как всё устроено и с чего лучше начать.


Выберите в настройках подходящий уровень сложности (лёгкий — рекомендуем 
начинать именно с него, средний, сложный), и система автоматически подберёт 
для вас оппонента. Победит тот, кто первым найдёт решение за ограниченное 
время.

По результатам матчей сервис формирует турнирную доску. Пользователи на 
топовых позициях получают приятные бонусы от школы.

Чтобы начать соревноваться, перейдите по ссылке. Добро пожаловать на IT HERO 
и успешных вам матчей!



