# C4.1. Введение 20.10.2023
#
# «Плохие программисты беспокоятся о коде. Хорошие программисты беспокоятся
# о структурах данных и их отношениях».
#
# Линус Торвальдс, создатель ядра ОС Linux.
#
# Конечно, это высказывание г-на Торвальдса не стоит воспринимать слишком
# буквально. Хорошие программисты беспокоятся и о коде тоже, но речь идет
# о первостепенной важности — ее имеют структуры данных, используемые
# в программе, и алгоритмы работы с ними. Как упоминали многие мэтры
# computer science (а именно так в англоговорящих странах называют всё,
# что прямо или косвенно относится к IT), лучше иметь умные структуры
# и не очень качественный код, чем наоборот.
#
# В ходе этого модуля вы:
#
# познакомитесь с различными структурами данных и их особенностями;
# приобретете навыки в применении структур данных к практическим задачам;
# узнаете, как использовать структуры данных из встроенных средств Python;
# и даже научитесь создавать свои структуры;
#
# научитесь применять алгоритмы поиска внутри структур;
# узнаете о способах сортировки и их эффективности.
#
# Путешествие в мир алгоритмов и структур данных немного более тернисто,
# чем изучение других, не менее важных, тем нашего курса, но можно быть
# уверенным, что и «награда» за этот путь — качественный код — стоит того!
